Repository: BadassHenkka/shuup-stripe
Catalog: shuup_stripe/locale/*/LC_MESSAGES/django.po
Languages: fi_fi

source: Connect your Stripe account to Shuup store. Once connected, you are able to receive payments.
fi_fi: Yhdistä Stripe tilisi Shuup kauppaasi. Voit vastaanottaa maksuja yhteyden luonnin jälkeen.

source: Connect Stripe
fi_fi: Yhdistä Stripe

source: Please configure Stripe keys for payment processor %s.
fi_fi: Aseta Stripen avaimet maksunkäsittelijälle %s.

source: Purchase
fi_fi: Osta

source: Secret Key
fi_fi: Salainen avain

source: Publishable Key
fi_fi: Julkinen avain

source: Stripe Checkout
fi_fi: Stripe-maksu

source: Payment for order {id} on {shop}
fi_fi: Tilauksen {id} maksu kaupassa {shop}

source: We use Stripe for secure payment handling.
fi_fi: Käytämme Stripeä turvalliseen maksunkäsittelyyn.

source: Click the button below to enter your card details. You will only be charged when your order completes.
fi_fi: Paina alla olevaa nappia syöttääksesi maksukortin tiedot. Maksu veloitetaan vasta kun tilauksesi on valmis.

source: Account connected
fi_fi: Tili yhdistetty

source: Yes
fi_fi: Kyllä

source: No
fi_fi: Ei

source: Stripe Payment Method
fi_fi: Stripe -maksutapa

source: Stripe Payment Method Active
fi_fi: Stripe maksutapa aktiivinen

source: Re-Connect with Stripe
fi_fi: Uudelleenyhdistä Stripe

source: Stripe Dashboard
fi_fi: Stripe kauppiaspaneeli

source: Connect with Stripe
fi_fi: Yhdistä Stripen kanssa

source: Cannot connect with Stripe. Please ask your service provider to re-configure your shop.
fi_fi: Stripeä ei voitu yhdistää. Ole hyvä ja pyydä palveluntarjoajaasi uudelleenmäärittelemään kauppasi asetukset.

source: Accept credit cards using <a target='_blank' href='%(url)s'>Stripe</a>
fi_fi: Vastaanota luottokorttimaksuja <a target='_blank' href='%(url)s'>Stripellä</a>

source: Don't have a Stripe account?
fi_fi: Eikö sinulla ole vielä Stripe-tunnusta?

source: Register now
fi_fi: Rekisteröidy nyt
